# Projeto para seguradora

## Relatorio de analise 1 </n>
#### Entendendo os dados

### Importando a base de dados

In [277]:
import pandas as pd

In [278]:
data = pd.read_csv('dados/aluguel.csv', sep = ';')

In [279]:
data.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [280]:
type(data)

pandas.core.frame.DataFrame

In [281]:
data.columns = ('tipo', 'bairro', 'quartos', 'vagas', 'suites', 'area', 'valor', 'condominio', 'iptu')

In [282]:
dados = data
dados

,tipo,bairro,quartos,vagas,suites,area,valor,condominio,iptu
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
...,...,...,...,...,...,...,...,...,...
32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN
32959,Conjunto Comercial/Sala,Centro,0,0,0,250,6500.0,4206.0,1109.0

In [283]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   tipo        32960 non-null  object
 1   bairro      32960 non-null  object
 2   quartos     32960 non-null  int64
 3   vagas       32960 non-null  int64
 4   suites      32960 non-null  int64
 5   area        32960 non-null  int64
 6   valor       32943 non-null  float64
 7   condominio  28867 non-null  float64
 8   iptu        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

### Informaçoes gerais sobre a base de dados

In [284]:
#quais o tipos de dados tenho na base?
dados.dtypes

tipo           object
bairro         object
quartos         int64
vagas           int64
suites          int64
area            int64
valor         float64
condominio    float64
iptu          float64
dtype: object

In [285]:
#melhorando a visualizaçao do dtypes
#transformar o dados.dtypes em uma tabela de melhor visualizaçao
tipos_de_dados = pd.DataFrame(dados.dtypes, columns = ['Tipos de dados'])

In [286]:
tipos_de_dados.columns.name = 'variaveis'
tipos_de_dados

variaveis  Tipos de dados
tipo               object
bairro             object
quartos             int64
vagas               int64
suites              int64
area                int64
valor             float64
condominio        float64
iptu              float64

In [287]:
dados.shape #retorna uma tupla com o numero de linhas e suas variaveis

(32960, 9)

In [288]:
print(f'Base de dados apresenta {dados.shape[0]} registros com {dados.shape[1]} itens')

Base de dados apresenta 32960 registros com 9 itens

#### <font color="yellow"> Exercicio - 1 (tipos de dados e formataçao)</font>

In [289]:
import pandas as pd
d_ex1 = [['Fulano', 12, 7.0, True],
        ['Sicrano', 15, 3.5, False], 
        ['Beltrano', 18, 9.3, True]]
df_ex1 = pd.DataFrame(
        d_ex1, 
        columns = ['Aluno', 'Idade', 'Nota', 'Aprovado'])
df_ex1

      Aluno  Idade  Nota  Aprovado
0    Fulano     12   7.0      True
1   Sicrano     15   3.5     False
2  Beltrano     18   9.3      True

In [290]:
td_ex1 = pd.DataFrame(
    df_ex1.dtypes,
    columns = ['tipos dados']
)

td_ex1.columns.name = 'variaveis'
td_ex1

variaveis tipos dados
Aluno          object
Idade           int64
Nota          float64
Aprovado         bool

#### <font color="yellow">fim do exercicio</font>